docs: ✏️ refatora os diagramas para mermaid
